Revit 2027 API
RebarSpliceShiftOption Enumeration
 Describes the way bars are shifted in the splice relation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarSpliceShiftOption
Public Enumeration RebarSpliceShiftOption
public enum class RebarSpliceShiftOption
type RebarSpliceShiftOption
Members
Member name | Value | Description
BarPlane | 0 |  Bar Plane is shifted so that the spliced rebars are not clashing.
None | 1 |  The bars are not shifted at all.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace